
/******************************************************************************

  版权所有 (C), 2001-2011, 华为技术有限公司

******************************************************************************
    文 件 名   : frame_store.h
    版 本 号   : 初稿
    作    者   : 
    生成日期   : 
    最近修改   :
    功能描述   : 公共帧存管理模块
     

 修改历史   :
    1.日    期 : 2009-08-24
    作    者   : 
    修改内容   : 

******************************************************************************/

#ifndef _PUB_FRAME_STORE_HEADER_
#define _PUB_FRAME_STORE_HEADER_

#include "basedef.h"
#include "vfmw.h"


/*================================== 常数 ===================================*/
#define   FS_OK     0
#define   FS_ERR   -1

#define   MAX_FS_NUM  64

/*==================================  宏  ===================================*/


/*================================== 结构 ===================================*/
/* 帧存 */
typedef struct hi_FS_S
{
    SINT8    *pu8VirAddr;
    SINT8     s32RefFlag;    /* 0: 两场全不参考，1: 顶场用作参考， 2: 底场用作参考， 3: 两场均作参考  */
    SINT8     s32DispFlag;   /* 0: 两场全不显示，1: 顶场等待显示， 2: 底场等待显示， 3: 两场均待显示  */
    /* 应用自定义信息 */
    IMAGE     stImage;

    /* 基本属性 */
    SINT32    s32FsID;
    SINT32    s32ErrLevel;

    /* 地址 */
    SINT32    s32PhyAddr;
} FS_S;


/* 帧存池 */
typedef struct hiFS_POOL_S
{
    FS_S      stFrameStore[MAX_FS_NUM];
    SINT32    s32ValidFsNum;
    /* 帧属性 */
    SINT32    s32FrameWidth;
    SINT32    s32FrameHeight;
    SINT32    s32FrameStride;
} FS_POOL_S;


/*****************************************************************************************
原型    VOID FS_InitFsPool(FS_POOL_S *pstFsPool, SINT32 FrameWidth, SINT32 FrameHeight, SINT32 FrameStride )
功能    初始化帧存池，清除其中残留信息
参数    ...
返回值  FS_OK, FS_ERR
******************************************************************************************/
SINT32 FS_InitFsPool(FS_POOL_S *pstFsPool, SINT32 s32FrameWidth, SINT32 s32FrameHeight, SINT32 s32FrameStride );

/*****************************************************************************************
原型    SINT32 FS_CreateFrameStore(FS_POOL_S *pstFsPool, SINT32 s32PhyAddr, UINT8 *pu8VirAddr)
功能    在帧存池中创建一个帧存信息，并且返回创建成功的帧存的编号
参数    ...
返回值   错误返回-1, 否则返回帧存的编号
******************************************************************************************/
SINT32 FS_CreateFrameStore(FS_POOL_S *pstFsPool, SINT32 s32PhyAddr, UINT8 *pu8VirAddr);

/*****************************************************************************************
原型    IMAGE *FS_GetImagePtr (FS_POOL_S *pstFsPool, SINT32 FsID)
功能    获取指定帧的image指针
参数    ...
返回值  成功返回image指针，否则返回NULL
******************************************************************************************/
IMAGE *FS_GetImagePtr (FS_POOL_S *pstFsPool, SINT32 FsID);

/*****************************************************************************************
原型    VOID  FS_MarkFsRef(FS_POOL_S *pstFsPool, SINT32 FsID, SINT32 RefFlag)
功能    修改指定帧存的参考标志
参数    ...
返回值  无
******************************************************************************************/
VOID  FS_MarkReference(FS_POOL_S *pstFsPool, SINT32 FsID, SINT32 RefFlag);

/*****************************************************************************************
原型    VOID FS_MarkFsDisplay(FS_POOL_S *pstFsPool, SINT32 FsID, SINT32 DispFlag)
功能    修改指定帧存的参考标志
参数    ...
返回值  无
******************************************************************************************/
VOID FS_MarkDisplay(FS_POOL_S *pstFsPool, SINT32 FsID, SINT32 DispFlag);

/*****************************************************************************************
原型    VOID FS_SetErrLevel(FS_POOL_S *pstFsPool, SINT32 FsID, SINT32 ErrLevel)
功能    修改指定帧存的错误率，在场对解码时可能用到
参数    ...
返回值  无
******************************************************************************************/
VOID FS_SetErrLevel(FS_POOL_S *pstFsPool, SINT32 FsID, SINT32 ErrLevel);

/*****************************************************************************************
原型    SINT32 FS_GetFreeFs(FS_POOL_S *pstFsPool)
功能    获取一个空闲的帧存
参数    ...
返回值  无
******************************************************************************************/
SINT32 FS_GetFreeFs(FS_POOL_S *pstFsPool);

/*****************************************************************************************
原型    VOID FS_ClearFsPool(FS_POOL_S *pstFsPool)
功能    清除帧存池中所有帧存的占用标志，使之全部处于空闲状态
参数    ...
返回值  无
******************************************************************************************/
VOID FS_ClearFsPool(FS_POOL_S *pstFsPool);

/*****************************************************************************************
原型    SINT32  FS_GetTotalNum(FS_POOL_S *pstFsPool)
功能    查询帧存池中的有效帧存个数
参数    ...
返回值  有效帧存个数
******************************************************************************************/
SINT32  FS_GetTotalNum(FS_POOL_S *pstFsPool);






#endif



